Pandas allows us to treat data in a table-like way (think excel) and to utilize a structure called a Data Frame. These methods make it much easier to manipulate and slice data. No more excessive loops and list comprehensions.

In [40]:
#import [something] as [new name]
import pandas as pd

In [41]:
#pulling from internet
#users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',  sep='|', index_col='user_id')

In [42]:
pwd

u'/Users/octaviapayne/Desktop/DAT-DC-10/notebooks'

In [15]:
#can also pull locally
users = pd.read_table('../DAT-DC-10/data/u.user', sep='|', index_col="user_id")

In [16]:
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107
26        49      M       engineer    21044
27        40      F      librarian    30030
28        32      M         writer    55369
29        41      M     programmer    94043
30         7      M        student    55436
...      ...    ...            ...      ...
914       44      F          other    08105
915       50      M  entertainment    60614
916       27      M       engineer    N2L5N
917       22      F        student    20006
918       40      M      scientist    70116
919       25      M          other    14216
920       30      F         artist    90008
921       20      F        student    98801
922       29      F  administrator    21114
923       21      M        student    E2E3R
924       29      M          other    11753
925       18      F       salesman    49036
926       49      M  entertainment    01701
927       23      M     programmer    55428
928       21      M        student    55408
929       44      M      scientist    53711
930       28      F      scientist    07310
931       60      M       educator    33556
932       58      M       educator    06437
933       28      M        student    48105
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [17]:
type(users) # Date Frame - pandas is all about this type of object

pandas.core.frame.DataFrame

In [18]:
users.head(5)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [19]:
users.columns

Index([u'age', u'gender', u'occupation', u'zip_code'], dtype='object')

In [20]:
users.index # The "index" or the row labels

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name=u'user_id', length=943)

In [21]:
users.shape
#returns (rows, columns)

(943, 4)

In [22]:
users.values # so there's an underlying "array" data type, and the Data Frame object encapsulates it, and adds more functionality

array([[24, 'M', 'technician', '85711'],
       [53, 'F', 'other', '94043'],
       [23, 'M', 'writer', '32067'],
       ...,
       [20, 'M', 'student', '97229'],
       [48, 'F', 'librarian', '78209'],
       [22, 'M', 'student', '77841']], dtype=object)

With a Data Frame, we have columns with names, so we can select on those columns.

In [23]:
# select a column
users['gender']         # select one column
users.gender            # or with dot notation

user_id
1      M
2      F
3      M
4      M
5      F
6      M
7      M
8      M
9      M
10     M
11     F
12     F
13     M
14     M
15     F
16     M
17     M
18     F
19     M
20     F
21     M
22     M
23     F
24     F
25     M
26     M
27     F
28     M
29     M
30     M
      ..
914    F
915    M
916    M
917    F
918    M
919    M
920    F
921    F
922    F
923    M
924    M
925    F
926    M
927    M
928    M
929    M
930    F
931    M
932    M
933    M
934    M
935    M
936    M
937    M
938    F
939    F
940    M
941    M
942    F
943    M
Name: gender, dtype: object

In [24]:
type(users.gender) # a Series is a basic data type in pandas

pandas.core.series.Series

Data Frames have many built-in functions for things we might commonly want. For example, if we want a statistical summary of the numeric columns.

In [25]:
# summarize (describe) the DataFrame
users.describe()                    # describe all numeric columns

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [26]:
# or a statistical summary of all columns
users.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

For any column, we can access useful statistical summaries.

In [27]:
users.age.mean()

34.05196182396607

In [28]:
users.gender.value_counts()

M    670
F    273
Name: gender, dtype: int64

** Exercise** 

1. Read drinks.csv into a DataFrame called 'drinks'
2. Print the head and the tail 
3. Examine the default index, data types, and shape
4. Print the 'beer_servings' Series
5. Calculate the mean 'beer_servings' for the entire dataset
6. Count the number of occurrences of each 'continent' value
7. **Bonus** Display only the number of rows of the 'users' DataFrame
8. **Bonus** Display the 3 most frequent occupations in 'users'

In [29]:
import pandas as pd
drinks = pd.read_table('../DAT-DC-10/data/drinks.csv', sep=',', index_col="country")

print drinks.head()
print drinks.tail()

             beer_servings  spirit_servings  wine_servings  \
country
Afghanistan              0                0              0
Albania                 89              132             54
Algeria                 25                0             14
Andorra                245              138            312
Angola                 217               57             45

             total_litres_of_pure_alcohol continent
country
Afghanistan                           0.0        AS
Albania                               4.9        EU
Algeria                               0.7        AF
Andorra                              12.4        EU
Angola                                5.9        AF
           beer_servings  spirit_servings  wine_servings  \
country
Venezuela            333              100              3
Vietnam              111                2              1
Yemen                  6                0              0
Zambia                32               19              4
Zimbabwe              64               18              4

           total_litres_of_pure_alcohol continent
country
Venezuela                           7.7        SA
Vietnam                             2.0        AS
Yemen                               0.1        AS
Zambia                              2.5        AF
Zimbabwe                            4.7        AF

In [30]:
drinks.index

Index([u'Afghanistan', u'Albania', u'Algeria', u'Andorra', u'Angola',
       u'Antigua & Barbuda', u'Argentina', u'Armenia', u'Australia',
       u'Austria',
       ...
       u'Tanzania', u'USA', u'Uruguay', u'Uzbekistan', u'Vanuatu',
       u'Venezuela', u'Vietnam', u'Yemen', u'Zambia', u'Zimbabwe'],
      dtype='object', name=u'country', length=193)

In [31]:
type(drinks)

pandas.core.frame.DataFrame

In [32]:
drinks.shape

(193, 5)

In [33]:
drinks.beer_servings.mean()

106.16062176165804

In [34]:
drinks.continent.value_counts()

AF    53
EU    45
AS    44
OC    16
SA    12
Name: continent, dtype: int64

In [35]:
drinks.describe(include='all')

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
count,193.000000,193.000000,193.000000,193.000000,170
unique,NaN,NaN,NaN,NaN,5
top,NaN,NaN,NaN,NaN,AF
freq,NaN,NaN,NaN,NaN,53
mean,106.160622,80.994819,49.450777,4.717098,NaN
std,101.143103,88.284312,79.697598,3.773298,NaN
min,0.000000,0.000000,0.000000,0.000000,NaN
25%,20.000000,4.000000,1.000000,1.300000,NaN
50%,76.000000,56.000000,8.000000,4.200000,NaN
75%,188.000000,128.000000,59.000000,7.200000,NaN
max,376.000000,438.000000,370.000000,14.400000,NaN

In [36]:
users.occupation.value_counts().head(3)
users.occupation.value_counts()[:3]

student     196
other       105
educator     95
Name: occupation, dtype: int64

Pandas provides easy functionality for a variety of filtering and sorting tasks we inevitably encounter. Again, this kind of work could be done with loops and conditionals, but the Data Frame methods make things much easier.

For example, we can filter on a boolean expression:

In [37]:
#  boolean filtering: only show users with age < 20
young_bool = users.age < 20         # create a Series of booleans...
users[young_bool]                   # ...and use that Series to filter rows
users[users.age < 20]               # or, combine into a single step #and = & or = |
users[users.age < 20]
users[users.age < 20].occupation    # select one column from the filtered results
users[users.age < 20].occupation.value_counts()     # value_counts of resulting Series

student          64
other             4
none              3
writer            2
entertainment     2
salesman          1
artist            1
Name: occupation, dtype: int64

And we can have filtering with multiple conditions:

In [38]:
# boolean filtering with multiple conditions
users[(users.age < 20) & (users.gender=='M')]       # ampersand for AND condition
users[(users.age < 20) | (users.age > 60)]          # pipe for OR condition

         age gender     occupation zip_code
user_id
30         7      M        student    55436
36        19      F        student    93117
52        18      F        student    55105
57        16      M           none    84010
67        17      M        student    60402
68        19      M        student    22904
101       15      M        student    05146
106       61      M        retired    55125
110       19      M        student    77840
142       13      M          other    48118
179       15      M  entertainment    20755
206       14      F        student    53115
211       66      M       salesman    32605
221       19      M        student    20685
223       19      F        student    47906
246       19      M        student    28734
257       17      M        student    77005
258       19      F        student    77801
262       19      F        student    78264
266       62      F  administrator    78756
270       18      F        student    63119
281       15      F        student    06059
289       11      M           none    94619
291       19      M        student    44106
303       19      M        student    14853
318       65      M        retired    06518
320       19      M        student    24060
341       17      F        student    44405
347       18      M        student    90210
349       68      M        retired    61455
...      ...    ...            ...      ...
631       18      F        student    38866
632       18      M        student    55454
642       18      F        student    95521
646       17      F        student    51250
651       65      M        retired    02903
674       13      F        student    55337
700       17      M        student    76309
710       19      M        student    92020
729       19      M        student    56567
747       19      M          other    93612
761       17      M        student    97302
767       70      M       engineer    00000
777       63      M     programmer    01810
787       18      F        student    98620
803       70      M  administrator    78212
813       14      F        student    02136
817       19      M        student    60152
845       64      M         doctor    97405
849       15      F        student    25652
851       18      M          other    29646
858       63      M       educator    09645
859       18      F          other    06492
860       70      F        retired    48322
863       17      M        student    60089
872       19      F        student    74078
880       13      M        student    83702
887       14      F        student    27249
904       17      F        student    61073
925       18      F       salesman    49036
934       61      M       engineer    22902

[99 rows x 4 columns]

And we can sort by various columns:

In [39]:
# sorting
users.age.sort_values()                   # sort a column
users.sort_values('age')                   # sort a DataFrame by a single column
users.sort_values('age', ascending=False)  # use descending order instead

         age gender     occupation zip_code
user_id
481       73      M        retired    37771
803       70      M  administrator    78212
767       70      M       engineer    00000
860       70      F        retired    48322
585       69      M      librarian    98501
559       69      M      executive    10022
349       68      M        retired    61455
573       68      M        retired    48911
211       66      M       salesman    32605
651       65      M        retired    02903
564       65      M        retired    94591
318       65      M        retired    06518
845       64      M         doctor    97405
423       64      M          other    91606
858       63      M       educator    09645
364       63      M       engineer    01810
777       63      M     programmer    01810
266       62      F  administrator    78756
520       62      M     healthcare    12603
934       61      M       engineer    22902
351       61      M       educator    49938
106       61      M        retired    55125
464       60      M         writer    94583
469       60      M       educator    78628
234       60      M        retired    94702
900       60      M        retired    18505
308       60      M        retired    95076
931       60      M       educator    33556
694       60      M     programmer    06365
752       60      M        retired    21201
...      ...    ...            ...      ...
700       17      M        student    76309
646       17      F        student    51250
863       17      M        student    60089
375       17      M  entertainment    37777
761       17      M        student    97302
621       17      M        student    60402
257       17      M        student    77005
904       17      F        student    61073
434       16      F        student    49705
451       16      M        student    48446
550       16      F        student    95453
57        16      M           none    84010
580       16      M        student    17961
179       15      M  entertainment    20755
461       15      M        student    98102
618       15      F        student    44212
849       15      F        student    25652
281       15      F        student    06059
101       15      M        student    05146
813       14      F        student    02136
887       14      F        student    27249
206       14      F        student    53115
628       13      M           none    94306
674       13      F        student    55337
142       13      M          other    48118
880       13      M        student    83702
609       13      F        student    55106
289       11      M           none    94619
471       10      M        student    77459
30         7      M        student    55436

[943 rows x 4 columns]

** Exercise** 

1. Filter 'drinks' to only include European countries
2. Filter 'drinks' to only include European countries with wine_servings > 300
3. Calculate the mean 'beer_servings' for all of Europe
4. Determine which 10 countries have the highest total_litres_of_pure_alcohol
5. **Bonus** Sort 'users' by 'occupation' and then by 'age' (in a single command)

In [40]:
drinks[drinks.continent == 'EU'] # Filter 'drinks' to only include European countries
drinks[(drinks.continent == 'EU') & (drinks.wine_servings > 300)] # Filter 'drinks' to only include European countries with wine_servings > 300
drinks[drinks.continent == 'EU'].beer_servings.mean() # Calculate the mean 'beer_servings' for all of Europe
drinks.sort_values('total_litres_of_pure_alcohol', ascending=False).head(10) # Determine which 10 countries have the highest total_litres_of_pure_alcohol
users.sort_values(by=['occupation', 'age'], ascending=[False, False]) # Sort 'users' by 'occupation' and then by 'age' (in a single command)

         age gender     occupation zip_code
user_id
464       60      M         writer    94583
558       56      F         writer    63132
370       52      M         writer    08534
392       52      M         writer    59801
548       51      M         writer    95468
503       50      F         writer    27514
772       50      M         writer    27105
196       49      M         writer    55105
518       49      F         writer    99709
853       49      M         writer    40515
736       48      F         writer    94618
829       48      M         writer    80209
236       44      F         writer    53214
389       44      F         writer    83702
491       43      F         writer    53711
390       42      F         writer    85016
745       42      M         writer    55113
504       40      F         writer    92115
798       40      F         writer    64131
842       40      M         writer    93055
911       37      F         writer    53210
264       36      F         writer    90064
385       36      M         writer    10003
833       34      M         writer    90019
28        32      M         writer    55369
122       32      F         writer    22206
796       32      F         writer    33755
199       30      M         writer    17604
557       30      F         writer    11217
668       29      F         writer    10016
...      ...    ...            ...      ...
400       33      F  administrator    78213
879       33      F  administrator    55337
762       32      M  administrator    95050
940       32      M  administrator    02215
95        31      M  administrator    10707
578       31      M  administrator    M7A1A
42        30      M  administrator    17870
174       30      F  administrator    52302
190       30      M  administrator    95938
436       30      F  administrator    17345
447       30      M  administrator    55113
768       29      M  administrator    12866
922       29      F  administrator    21114
261       28      M  administrator    85202
500       28      M  administrator    94305
748       28      M  administrator    94720
750       28      M  administrator    32303
62        27      F  administrator    97214
525       27      F  administrator    19711
78        26      M  administrator    61801
86        26      M  administrator    46005
394       25      M  administrator    96819
665       25      M  administrator    55412
726       25      F  administrator    80538
439       23      F  administrator    20817
509       23      M  administrator    10011
180       22      F  administrator    60202
282       22      M  administrator    20057
317       22      M  administrator    13210
118       21      M  administrator    90210

[943 rows x 4 columns]

We can easily rename columns if needed. And it is easy to remove existing columns or to add new ones.

In [43]:
drinks = pd.read_csv("../DAT-DC-10/data/drinks.csv")
# rename one or more columns
drinks.rename(columns={'beer_servings':'beer', 'wine_servings':'wine'})
drinks.rename(columns={'beer_servings':'beer', 'wine_servings':'wine'}, inplace=True)

In [44]:
# replace all column names
drink_cols = ['country', 'beer', 'spirit', 'wine', 'liters', 'continent']
drinks.columns = drink_cols

In [45]:
# replace all column names when reading the file
drinks = pd.read_csv('../DAT-DC-10/data/drinks.csv', header=0, names=drink_cols)

In [50]:
# add a new column as a function of existing columns
drinks['servings'] = drinks.beer + drinks.spirit + drinks.wine
drinks['mL'] = drinks.liters * 1000
drinks.head(2)

       country  beer  spirit  wine  liters continent  servings    mL
0  Afghanistan     0       0     0     0.0        AS         0     0
1      Albania    89     132    54     4.9        EU       275  4900

In [52]:
drinks['total_milliliters_of_alcohol'] = 1000 * drinks.liters

In [117]:
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,total_milliliters_of_alcohol
country,,,,,,
Afghanistan,0,0,0,0.0,AS,0
Albania,89,132,54,4.9,EU,4900
Algeria,25,0,14,0.7,AF,700
Andorra,245,138,312,12.4,EU,12400
Angola,217,57,45,5.9,AF,5900

In [ ]:
# removing columns
drinks.drop('mL', axis=1)                               # axis=0 for rows, 1 for columns
drinks.drop(['mL', 'servings'], axis=1, inplace=True)   # drop multiple columns

In data analysis, we often encounter missing data and need to think about how to handle this. Many methods will simply ignore missing data, and we just need to make sure we're handling things sensibly.

In [30]:
# missing values are usually excluded by default
drinks.continent.value_counts()              # excludes missing values
drinks.continent.value_counts(dropna=False)  # includes missing values

AF     53
EU     45
AS     44
NaN    23
OC     16
SA     12
Name: continent, dtype: int64

In [ ]:
# find missing values in a Series
drinks.continent.isnull()           # True if missing
drinks.continent.notnull()          # True if not missing

In [ ]:
# use a boolean Series to filter DataFrame rows
drinks[drinks.continent.isnull()]   # only show rows where continent is missing
drinks[drinks.continent.notnull()]  # only show rows where continent is not missing

In [ ]:
# side note: understanding axes
drinks.sum()            # sums "down" the 0 axis (rows)
drinks.sum(axis=0)      # equivalent (since axis=0 is the default)
drinks.sum(axis=1)      # sums "across" the 1 axis (columns)

In [ ]:
# side note: adding booleans
pd.Series([True, False, True])          # create a boolean Series
pd.Series([True, False, True]).sum()    # converts False to 0 and True to 1

In [ ]:
# find missing values in a DataFrame
drinks.isnull()             # DataFrame of booleans
drinks.isnull().sum()       # count the missing values in each column

In [ ]:
# drop missing values
drinks.dropna()             # drop a row if ANY values are missing
drinks.dropna(how='all')    # drop a row only if ALL values are missing

In [ ]:
# fill in missing values
drinks.continent.fillna(value='NA', inplace=True)   # fill in missing values with 'NA'

In [ ]:
# turn off the missing value filter
drinks = pd.read_csv('drinks.csv', header=0, names=drink_cols, na_filter=False)

** Exercise** 

1. Read ufo.csv into a DataFrame called 'ufo'
2. Check the shape of the DataFrame
3. Calculate the most frequent value for each of the columns (in a single command)
4. What are the four most frequent colors reported?
5. For reports in VA, what's the most frequent city?
6. Show only the UFO reports from Arlington, VA
7. Count the number of missing values in each column
8. Show only the UFO reports in which the City is missing
9. How many rows remain if you drop all rows with any missing values?
10. **Bonus** Create a new column called 'Location' that includes both City and State
11. **Bonus** Replace any spaces in the column names with an underscore

In [103]:
# Read ufo.csv into a DataFrame called 'ufo'
import pandas as pd
ufo = pd.read_csv('../data/ufo.csv', delimiter=",")

In [104]:
# Check the shape of the DataFrame
ufo.shape

(80543, 5)

In [90]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [105]:
# Calculate the most frequent value for each of the columns (in a single command)
ufo.describe()

           City Colors Reported Shape Reported  State            Time
count     80496           17034          72141  80543           80543
unique    13504              31             27     52           68901
top     Seattle          ORANGE          LIGHT     CA  7/4/2014 22:00
freq        646            5216          16332  10743              45

In [111]:
# What are the four most frequent colors reported?
ufo['Colors Reported'].value_counts().head(4)

ORANGE    5216
RED       4809
GREEN     1897
BLUE      1855
Name: Colors Reported, dtype: int64

In [117]:
# For reports in VA, what's the most frequent city?
ufo[ufo.State == 'VA'].City.value_counts().head(1)

Virginia Beach    110
Name: City, dtype: int64

In [118]:
# Show only the UFO reports from Arlington, VA
ufo[(ufo.State == 'VA') & (ufo.City == "Arlington")]

            City Colors Reported Shape Reported State              Time
202    Arlington           GREEN           OVAL    VA   7/13/1952 21:00
6300   Arlington             NaN        CHEVRON    VA    5/5/1990 21:40
10278  Arlington             NaN           DISK    VA   5/27/1997 15:30
14527  Arlington             NaN          OTHER    VA   9/10/1999 21:41
17984  Arlington             RED           DISK    VA  11/19/2000 22:00
21201  Arlington           GREEN       FIREBALL    VA    1/7/2002 17:45
22633  Arlington             NaN          LIGHT    VA    7/26/2002 1:15
22780  Arlington             NaN          LIGHT    VA    8/7/2002 21:00
25066  Arlington             NaN          CIGAR    VA    6/1/2003 22:34
27398  Arlington             NaN        VARIOUS    VA   12/13/2003 2:00
30608  Arlington             NaN         CIRCLE    VA   10/9/2004 22:30
31316  Arlington             NaN      FORMATION    VA   12/13/2004 0:30
35787  Arlington             NaN          LIGHT    VA   3/15/2006 22:30
37036  Arlington             NaN       TRIANGLE    VA    8/1/2006 22:00
39673  Arlington             NaN          LIGHT    VA    4/7/2007 18:45
41083  Arlington             NaN          FLASH    VA    8/15/2007 1:30
44562  Arlington             NaN       TRIANGLE    VA    6/6/2008 21:55
45450  Arlington             NaN           OVAL    VA    8/2/2008 20:30
48679  Arlington             NaN         SPHERE    VA   4/24/2009 17:45
54613  Arlington             NaN          LIGHT    VA   9/17/2010 19:00
54944  Arlington             NaN         SPHERE    VA  10/12/2010 19:00
70462  Arlington             NaN       FIREBALL    VA   6/25/2013 23:00
72856  Arlington             RED         SPHERE    VA   9/26/2013 21:20
73408  Arlington             NaN         CIRCLE    VA   10/19/2013 0:17
73747  Arlington             NaN          LIGHT    VA   11/1/2013 22:42
76144  Arlington             NaN          CIGAR    VA   2/21/2014 14:30
76325  Arlington             NaN            NaN    VA    3/1/2014 20:00
76337  Arlington             NaN      FORMATION    VA    3/1/2014 23:30
77807  Arlington      RED ORANGE          LIGHT    VA   5/24/2014 22:30
79122  Arlington             NaN         CIRCLE    VA    7/7/2014 21:00

In [126]:
# Count the number of missing values in each column
ufo.isnull().sum()

City                  47
Colors Reported    63509
Shape Reported      8402
State                  0
Time                   0
dtype: int64

In [127]:
# Show only the UFO reports in which the City is missing
ufo[ufo.City.isnull()]

      City  Colors Reported Shape Reported State              Time
21     NaN              NaN            NaN    LA    8/15/1943 0:00
22     NaN              NaN          LIGHT    LA    8/15/1943 0:00
204    NaN              NaN           DISK    CA   7/15/1952 12:30
241    NaN             BLUE           DISK    MT    7/4/1953 14:00
613    NaN              NaN           DISK    NV    7/1/1960 12:00
1877   NaN           YELLOW         CIRCLE    AZ    8/15/1969 1:00
2013   NaN              NaN            NaN    NH     8/1/1970 9:30
2546   NaN              NaN       FIREBALL    OH  10/25/1973 23:30
3123   NaN              RED       TRIANGLE    WV  11/25/1975 23:00
4736   NaN              NaN         SPHERE    CA   6/23/1982 23:00
5269   NaN              NaN            NaN    AZ   6/30/1985 21:30
6735   NaN              NaN      FORMATION    TX     4/1/1992 2:00
7208   NaN              NaN         CIRCLE    MI   10/4/1993 17:30
8828   NaN              NaN       TRIANGLE    WA  10/30/1995 21:30
8967   NaN              NaN        VARIOUS    CA   12/8/1995 18:00
9273   NaN              NaN       TRIANGLE    OH     5/1/1996 3:00
9388   NaN              NaN           OVAL    CA   6/12/1996 12:00
9587   NaN              NaN            EGG    FL   8/24/1996 15:00
10399  NaN              NaN       TRIANGLE    IL   6/15/1997 23:00
11625  NaN              NaN         CIRCLE    TX     6/7/1998 7:00
12441  NaN              RED       FIREBALL    WA  10/26/1998 17:58
15767  NaN              NaN      RECTANGLE    NV   1/21/2000 11:30
15812  NaN              NaN          LIGHT    NV     2/2/2000 3:00
16054  NaN            GREEN            NaN    FL    3/11/2000 3:30
16608  NaN              NaN         SPHERE    NY   6/15/2000 15:00
19209  NaN              NaN          LIGHT    FL   5/17/2001 20:22
20525  NaN              NaN       TRIANGLE    CA   10/1/2001 21:00
21502  NaN              NaN          OTHER    KS    2/17/2002 4:16
22895  NaN              NaN         CIRCLE    KS    8/14/2002 5:00
24454  NaN              NaN          LIGHT    NE   2/12/2003 21:30
26437  NaN              NaN       TRIANGLE    CA    9/28/2003 1:00
27301  NaN              NaN          LIGHT    IL   12/1/2003 18:00
28429  NaN              NaN         CIRCLE    CA    4/2/2004 21:00
30767  NaN              NaN       CYLINDER    OH  10/24/2004 23:27
33396  NaN              NaN           DISK    CA    7/29/2005 0:00
35265  NaN              NaN         SPHERE    VT    1/3/2006 12:12
36659  NaN              NaN           OVAL    TN    6/28/2006 9:15
37780  NaN  RED ORANGE BLUE       FIREBALL    AR  10/10/2006 19:00
44455  NaN              NaN       CYLINDER    AZ   5/26/2008 14:00
44771  NaN              NaN       CYLINDER    NM   6/20/2008 10:00
47044  NaN              NaN          LIGHT    IL  11/26/2008 15:30
48778  NaN              NaN      FORMATION    CA    5/9/2009 15:45
56676  NaN              NaN         SPHERE    VA    4/4/2011 18:00
60654  NaN              NaN       CYLINDER    PA  12/20/2011 12:00
72502  NaN              NaN          LIGHT    OH    9/12/2013 3:00
72503  NaN              NaN           OVAL    OH    9/12/2013 3:00
78525  NaN              RED       TRIANGLE    CA   6/25/2014 22:15

In [132]:
# How many rows remain if you drop all rows with any missing values?
ufo.dropna().count()

City               15510
Colors Reported    15510
Shape Reported     15510
State              15510
Time               15510
dtype: int64

In [137]:
# Bonus Create a new column called 'Location' that includes both City and State
ufo['Location'] = ufo.City + ", " + ufo.State
ufo.head(2)

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"

In [148]:
# Bonus Replace any spaces in the column names with an underscore
new_columns = ufo.columns.str.replace(' ', '_')
ufo.columns = new_columns
ufo.head()

,City,Colors_Reported,Shape_Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

We can perform operations on Data Frame subsets and then record only the result for each subset. Think about this as a [split-apply-combine](http://i.imgur.com/yjNkiwL.png) operation. Or perhaps you're familiar with the notion of "Group By".

In [120]:
# for each continent, calculate the mean beer servings
drinks.groupby('continent').beer_servings.mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

In [ ]:
# for each continent, count the number of occurrences
drinks.continent.value_counts()

In [ ]:
# for each continent, describe beer servings
drinks.groupby('continent').beer.describe()

In [136]:
# similar, but outputs a DataFrame and can be customized
drinks.groupby('continent').beer_servings.agg(['count', 'mean', 'min', 'max'])
drinks.groupby('continent').beer_servings.agg(['count', 'mean', 'min', 'max']).sort_values('mean')

           count        mean  min  max
continent
AS            44   37.045455    0  247
AF            53   61.471698    0  376
OC            16   89.687500    0  306
SA            12  175.083333   93  333
EU            45  193.777778    0  361

In [62]:
# if you don't specify a column to which the aggregation function should be applied,
# it will be applied to all numeric columns
drinks.groupby('continent').mean()
#drinks.groupby('continent').describe()

,beer,spirit,wine,liters,servings,mL,total_milliliters_of_alcohol
continent,,,,,,,
AF,61.471698,16.339623,16.264151,3.007547,94.075472,3007.547170,3007.547170
AS,37.045455,60.840909,9.068182,2.170455,106.954545,2170.454545,2170.454545
EU,193.777778,132.555556,142.222222,8.617778,468.555556,8617.777778,8617.777778
OC,89.687500,58.437500,35.625000,3.381250,183.750000,3381.250000,3381.250000
SA,175.083333,114.750000,62.416667,6.308333,352.250000,6308.333333,6308.333333

** Exercise **

1. For each occupation in 'users', count the number of occurrences
2. For each occupation, calculate the mean age
3. **Bonus** For each occupation, calculate the minimum and maximum ages
4. **Bonus** For each combination of occupation and gender, calculate the mean age
5. Think about how obnoxious it would be to do all this stuff with a for loop.

In [68]:
# For each occupation in 'users', count the number of occurrences
users.occupation.value_counts().head(3)

student     196
other       105
educator     95
Name: occupation, dtype: int64

In [67]:
# For each occupation, calculate the mean age
users.groupby('occupation').age.mean().head(3)

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
Name: age, dtype: float64

In [66]:
# Bonus For each occupation, calculate the minimum and maximum ages
users.groupby('occupation').age.agg(['min','max']).head(3)

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64

In [77]:
# Bonus For each combination of occupation and gender, calculate the mean age
users.groupby(['occupation', 'gender']).age.mean().head(7)

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
Name: age, dtype: float64

Think about how obnoxious it would be to do all this stuff with a for loop

Also, note that we can select multiple columns or rows when we're going this kind of subsetting.

In [ ]:
# select multiple columns
my_cols = ['City', 'State']     # create a list of column names...
ufo[my_cols]                    # ...and use that list to select columns
ufo[['City', 'State']]          # or, combine into a single step

In [ ]:
# use loc to select columns by name
ufo.loc[:, 'City']              # colon means "all rows", then select one column
ufo.loc[:, ['City', 'State']]   # select two columns
ufo.loc[:, 'City':'State']      # select a range of columns

In [ ]:
# loc can also filter rows by "name" (the index)
ufo.loc[0, :]                   # row 0, all columns
ufo.loc[0:2, :]                 # rows 0/1/2, all columns
ufo.loc[0:2, 'City':'State']    # rows 0/1/2, range of columns

In [ ]:
# use iloc to filter rows and select columns by integer position
ufo.iloc[:, [0, 3]]             # all rows, columns in position 0/3
ufo.iloc[:, 0:4]                # all rows, columns in position 0/1/2/3
ufo.iloc[0:3, :]                # rows in position 0/1/2, all columns

Here's a grab-bag of other common Data Frame features that you'll commonly use.

In [79]:
# map existing values to a different set of values
users['is_male'] = users.gender.map({'F':0, 'M':1})

In [ ]:
# encode strings as integer values (automatically starts at 0)
users['occupation_num'] = users.occupation.factorize()[0]

In [ ]:
# determine unique values in a column
users.occupation.nunique()      # count the number of unique values
users.occupation.unique()       # return the unique values

In [ ]:
# replace all instances of a value in a column (must match entire value)
ufo.State.replace('Fl', 'FL', inplace=True)

In [ ]:
# string methods are accessed via 'str'
ufo.State.str.upper()                               # converts to uppercase
ufo.Colors_Reported.str.contains('RED', na='False') # checks for a substring

In [ ]:
# convert a string to the datetime format
ufo['Time'] = pd.to_datetime(ufo.Time)
ufo.Time.dt.hour                        # datetime format exposes convenient attributes
(ufo.Time.max() - ufo.Time.min()).days  # also allows you to do datetime "math"
ufo[ufo.Time > pd.datetime(2014, 1, 1)] # boolean filtering with datetime format

In [ ]:
# setting and then removing an index
ufo.set_index('Time', inplace=True)
ufo.reset_index(inplace=True)

In [ ]:
# sort a column by its index
ufo.State.value_counts().sort_index()

In [ ]:
# change the data type of a column
drinks['beer'] = drinks.beer.astype('float')

In [ ]:
# change the data type of a column when reading in a file
pd.read_csv('drinks.csv', dtype={'beer_servings':float})

In [ ]:
# create dummy variables for 'continent' and exclude first dummy column
continent_dummies = pd.get_dummies(drinks.continent, prefix='cont').iloc[:, 1:]

In [ ]:
# concatenate two DataFrames (axis=0 for rows, axis=1 for columns)
drinks = pd.concat([drinks, continent_dummies], axis=1)

Here's some less-frequently-used stuff that's good to know about.

In [ ]:
# create a DataFrame from a dictionary
pd.DataFrame({'capital':['Montgomery', 'Juneau', 'Phoenix'], 'state':['AL', 'AK', 'AZ']})

In [ ]:
# create a DataFrame from a list of lists
pd.DataFrame([['Montgomery', 'AL'], ['Juneau', 'AK'], ['Phoenix', 'AZ']], columns=['capital', 'state'])

In [ ]:
# detecting duplicate rows
users.duplicated()          # True if a row is identical to a previous row
users.duplicated().sum()    # count of duplicates
users[users.duplicated()]   # only show duplicates
users.drop_duplicates()     # drop duplicate rows
users.age.duplicated()      # check a single column for duplicates
users.duplicated(['age', 'gender', 'zip_code']).sum()   # specify columns for finding duplicates

In [ ]:
# display a cross-tabulation of two Series
pd.crosstab(users.occupation, users.gender)

In [ ]:
# alternative syntax for boolean filtering (noted as "experimental" in the documentation)
users.query('age < 20')                 # users[users.age < 20]
users.query("age < 20 and gender=='M'") # users[(users.age < 20) & (users.gender=='M')]
users.query('age < 20 or age > 60')     # users[(users.age < 20) | (users.age > 60)]

In [ ]:
# display the memory usage of a DataFrame
ufo.info()          # total usage
ufo.memory_usage()  # usage by column

In [ ]:
# change a Series to the 'category' data type (reduces memory usage and increases performance)
ufo['State'] = ufo.State.astype('category')

In [ ]:
# temporarily define a new column as a function of existing columns
drinks.assign(servings = drinks.beer + drinks.spirit + drinks.wine)

In [ ]:
# limit which rows are read when reading in a file
pd.read_csv('drinks.csv', nrows=10)           # only read first 10 rows
pd.read_csv('drinks.csv', skiprows=[1, 2])    # skip the first two rows of data

In [ ]:
# write a DataFrame out to a CSV
drinks.to_csv('drinks_updated.csv')                 # index is used as first column
drinks.to_csv('drinks_updated.csv', index=False)    # ignore index

In [ ]:
# save a DataFrame to disk (aka 'pickle') and read it from disk (aka 'unpickle')
drinks.to_pickle('drinks_pickle')
pd.read_pickle('drinks_pickle')

In [ ]:
# randomly sample a DataFrame
train = drinks.sample(frac=0.75, random_state=1)    # will contain 75% of the rows
test = drinks[~drinks.index.isin(train.index)]      # will contain the other 25%

In [ ]:
# change the maximum number of rows and columns printed ('None' means unlimited)
pd.set_option('max_rows', None)     # default is 60 rows
pd.set_option('max_columns', None)  # default is 20 columns
print drinks

In [ ]:
# reset options to defaults
pd.reset_option('max_rows')
pd.reset_option('max_columns')

That's a lot of litte odds-and-ends, but I hope you realize that the Data Frame idea is superbly useful will save us a lot of work.

In [64]:
import pandas as pd
#average number of toppings per burrito
orders = pd.read_table('../data/chipotle.tsv', sep='\t', index_col="order_id")

In [65]:
orders.head()

,quantity,item_name,choice_description,item_price
order_id,,,,
1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,Izze,[Clementine],$3.39
1,1,Nantucket Nectar,[Apple],$3.39
1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [69]:
total_burritos = orders.item_name.str.contains('Burrito').sum()
total_burritos

1172

In [74]:
total_toppings = (orders[orders.item_name.str.contains('Burrito')].choice_description.str.count(',') + 1).sum()
total_toppings

6323

In [73]:
avg_toppings_per_burrito = float(total_toppings) / total_burritos
round(avg_toppings_per_burrito, 2)

5.4